## Convetion of importing Pandas

In [1]:
import pandas as pd
import numpy as np

In [3]:
days = pd.Series(['Monday','Tuesday','Wednesday'])
print(days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [5]:
# Creating series with anumpy array
days_list = np.array(['Monday', 'Tuesday','Wednesday'])
print(days_list)
numpy_days = pd.Series(days_list)
print(numpy_days)

['Monday' 'Tuesday' 'Wednesday']
0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [7]:
# Using String index from a dictionary
days1 = pd.Series({'a':'Monday','b':'Tuesday','c':'Wednesday'})
print(days)
print(days1)

0       Monday
1      Tuesday
2    Wednesday
dtype: object
a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [14]:
# Accessing series by index value
print(days[0])
print(days1['c'])
print(days[:])
print(days[2:])
print(days[:2])
print(days[:])

Monday
Wednesday
0       Monday
1      Tuesday
2    Wednesday
dtype: object
2    Wednesday
dtype: object
0     Monday
1    Tuesday
dtype: object
0       Monday
1      Tuesday
2    Wednesday
dtype: object

In [15]:
print(pd.DataFrame())

Empty DataFrame
Columns: []
Index: []

In [16]:
# Create a dataframe from a dictionary
df_dict = {'Country':['Ghana','Kenya','Brazil','Bangladesh'],
          'Capital':['Accra','Nairobi','Brazila','Dhaka'],
          'Population':[10000,7500,3500,20000],
          'Age':[60,70,80,90]}

In [17]:
df = pd.DataFrame(df_dict,index=[2, 4, 6, 8])

In [18]:
print(df)

      Country  Capital  Population  Age
2       Ghana    Accra       10000   60
4       Kenya  Nairobi        7500   70
6      Brazil  Brazila        3500   80
8  Bangladesh    Dhaka       20000   90

In [24]:
# Dataframe using list
df_list = [['Ghana','Accra','10000',60],
          ['Kenya','Nairobi',7500,70],
          ['Brazil','Brazila',3500,80],
           ['Bangladesh','Dhaka',20000,90]]

df2 = pd.DataFrame(df_list, columns=['Country','Capital','Population','Age'], index =[2, 4, 6, 8])

In [25]:
print(df2)

      Country  Capital Population  Age
2       Ghana    Accra      10000   60
4       Kenya  Nairobi       7500   70
6      Brazil  Brazila       3500   80
8  Bangladesh    Dhaka      20000   90

In [29]:
# Select the rows in the index 3
print(df2.iloc[3])

Country       Bangladesh
Capital            Dhaka
Population         20000
Age                   90
Name: 8, dtype: object

In [30]:
# Select the rows in the index 3
print(df2.iloc[2])

Country        Brazil
Capital       Brazila
Population       3500
Age                80
Name: 6, dtype: object

In [34]:
# Select row with index label 6
print(df.loc[2])

Country       Ghana
Capital       Accra
Population    10000
Age             NaN
Name: 2, dtype: object

In [35]:
# Select the capital column
print(df['Capital'])

2      Accra
4    Nairobi
6    Brazila
8      Dhaka
Name: Capital, dtype: object

In [37]:
# print specific information
print(df.at[8,'Country'])

Bangladesh

In [40]:
print(df.iat[2,0])

Brazil

In [42]:
print(df.iat[2,1])

Brazila

In [43]:
print(df.iat[2,2])

3500

In [44]:
print(df.iat[2,3])

80.0

In [54]:
df['Population'].sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of 2    10000
4     7500
6     3500
8    20000
Name: Population, dtype: object>

In [55]:
df.mean()

C:\Users\ahmri\AppData\Local\Temp\ipykernel_4476\3698961737.py:1: FutureWarning: The default value of numeric_only in DataFrame.mean is deprecated. In a future version, it will default to False. In addition, specifying 'numeric_only=None' is deprecated. Select only valid columns or specify the value of numeric_only to silence this warning.
  df.mean()

Age    80.0
dtype: float64

In [56]:
df.describe()

        Age
count   3.0
mean   80.0
std    10.0
min    70.0
25%    75.0
50%    80.0
75%    85.0
max    90.0

In [57]:
df_dict2 = {'Name':['James','Rishad','Sandeep'],
           'Profession':['Researcher','BI Developer','Truck Driver'],
           'Experience':[12, np.nan,10],
           'Height':[np.nan,175, 180]}

In [58]:
print(df_dict2)

{'Name': ['James', 'Rishad', 'Sandeep'], 'Profession': ['Researcher', 'BI Developer', 'Truck Driver'], 'Experience': [12, nan, 10], 'Height': [nan, 175, 180]}

In [59]:
new_df = pd.DataFrame(df_dict2)

In [60]:
new_df

      Name    Profession  Experience  Height
0    James    Researcher        12.0     NaN
1   Rishad  BI Developer         NaN   175.0
2  Sandeep  Truck Driver        10.0   180.0

In [62]:
new_df.isnull()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False

In [64]:
new_df.dropna()

      Name    Profession  Experience  Height
2  Sandeep  Truck Driver        10.0   180.0